In [2]:
from pandas import Series, DataFrame

In [23]:
import pandas as pd

In [24]:
import numpy as np

In [3]:
obj = Series([1,4,5,7]) # 一组数据以及一组与其相关的索引组成

In [4]:
obj # 索引在左边，值在右边

0    1
1    4
2    5
3    7
dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([1,2,3,4],index = ['a','b','c','d'])

In [7]:
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
sdata = {'ohio':35000,'texas':71000,'oregon':16000,'utah':5000}

In [9]:
obj3 = Series(sdata)

In [11]:
obj3

ohio      35000
oregon    16000
texas     71000
utah       5000
dtype: int64

In [12]:
states = ['california','ohio','oregon','texas']

In [13]:
obj4 = Series(sdata,index=states)

In [14]:
obj4 # 在Pandas中，用于表示缺失或NA值

california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
dtype: float64

In [15]:
pd.isnull(obj4) #检测缺失数据

california     True
ohio          False
oregon        False
texas         False
dtype: bool

In [16]:
pd.notnull(obj4)

california    False
ohio           True
oregon         True
texas          True
dtype: bool

In [17]:
obj3 + obj4

california         NaN
ohio           70000.0
oregon         32000.0
texas         142000.0
utah               NaN
dtype: float64

In [3]:
data1 = {'state':['ohio','ohio','ohio','nevada','nevada'],
        'year':[2000,2001,2002,2003,2004],
        'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data1)

In [4]:
frame

   pop   state  year
0  1.5    ohio  2000
1  1.7    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2003
4  2.9  nevada  2004

In [5]:
DataFrame(data1,columns = ['state','year','pop'])

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2003  2.4
4  nevada  2004  2.9

In [6]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
frame.columns

Index([u'pop', u'state', u'year'], dtype='object')

In [8]:
print frame['state']

0      ohio
1      ohio
2      ohio
3    nevada
4    nevada
Name: state, dtype: object

In [9]:
frame.year

0    2000
1    2001
2    2002
3    2003
4    2004
Name: year, dtype: int64

In [12]:
frame.ix[1]

pop       1.7
state    ohio
year     2001
Name: 1, dtype: object

In [14]:
pop = {'nevada':{2001:2.4,2002:2.9},
      'ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [15]:
frame3 = DataFrame(pop)

In [16]:
frame3

      nevada  ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [18]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [21]:
frame3.reindex(['a','b','c','d'],fill_value=0)

   nevada  ohio
a     0.0   0.0
b     0.0   0.0
c     0.0   0.0
d     0.0   0.0

In [30]:
frame4 = DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['ohio','texas','california'])

In [26]:
frame4

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

In [35]:
frame4.reindex(['a','b','c','d'],fill_value=9)

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8
d     9      9           9

In [42]:
frame4.drop('c')

   ohio  texas  california
a     0      1           2
b     3      4           5

m

In [44]:
df1 = DataFrame(np.arange(12).reshape((3,4)),columns=list('abcd'))
df2 = DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))

In [45]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [46]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [47]:
df1+df2 #没有重叠的位置会产生NA值

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [48]:
df1.add(df2,fill_value=0) # 使用add方法，传入一个fill_value值

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [49]:
frame5 = DataFrame(np.random.randn(4,3),columns=list('bde'),
                  index=['utah','ohio','texas','oregon'])

In [50]:
frame5

               b         d         e
utah   -0.516020  2.359242  0.965261
ohio    0.862760  0.789032  0.659924
texas  -1.139962  0.601681 -0.045454
oregon  1.070183 -1.516461  0.600896

In [51]:
f = lambda x: x.max() - x.min()

In [52]:
frame5.apply(f) # 将函数运用到数组中

b    2.210146
d    3.875704
e    1.010714
dtype: float64

In [53]:
frame5.apply(f,axis=1)  # axis=0表示列操作，axis=1表示行操作

utah      2.875262
ohio      0.202836
texas     1.741643
oregon    2.586645
dtype: float64

In [54]:
obj = Series(range(4),index=['d','a','b','e'])

In [56]:
obj.sort_index() #对索引进行排序

a    1
b    2
d    0
e    3
dtype: int64

In [58]:
obj2=Series([4,-2,4,5])

In [60]:
obj2.rank() #排名与排序无关，会增设一个排名值

0    2.5
1    1.0
2    2.5
3    4.0
dtype: float64

In [63]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],
               [np.nan,np.nan],[0.75,-1.3]],
               index=list('abcd'),columns=['one','two'])

In [64]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [67]:
df.sum(axis=1,skipna=False) #汇总

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [68]:
df.idxmax()

one    b
two    d
dtype: object

In [69]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [70]:
df.describe() #一次性产生多个汇总统计

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [71]:
nums = Series(['c','c','a','b','d','m'])

In [72]:
unique = nums.unique()

In [73]:
unique

array(['c', 'a', 'b', 'd', 'm'], dtype=object)

In [75]:
nums.value_counts()

c    2
d    1
m    1
b    1
a    1
dtype: int64

In [76]:
string_data = Series(['ak','ap',np.nan,'as'])

In [77]:
string_data #处理缺失数据，以NaN填补缺失数据

0     ak
1     ap
2    NaN
3     as
dtype: object

In [79]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [80]:
string_data.dropna() # Series过滤掉缺失的数据

0    ak
1    ap
3    as
dtype: object

In [81]:
string_data[string_data.notnull()] #过滤数据的另一种形式

0    ak
1    ap
3    as
dtype: object

In [82]:
cleaned = DataFrame([[1,6.5,3],[1,np.nan,np.nan],
                    [np.nan,np.nan,np.nan],[np.nan,6.5,3]])

In [83]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [84]:
cleaned.dropna() # DataFrame默认丢弃任何含有缺失值的行

     0    1    2
0  1.0  6.5  3.0

In [85]:
series = Series([[1,2,np.nan],[np.nan,3,4]])

In [86]:
series

0    [1, 2, nan]
1    [nan, 3, 4]
dtype: object

In [87]:
series.dropna()

0    [1, 2, nan]
1    [nan, 3, 4]
dtype: object

In [88]:
cleaned.dropna(how='all') #只丢弃全为NaN的数据行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [89]:
df = DataFrame(np.random.randn(7,3))

In [92]:
df.ix[:4,1]=np.nan;
df.ix[:2,2]=np.nan

In [93]:
df

          0         1         2
0  0.004161       NaN       NaN
1 -1.048985       NaN       NaN
2 -0.617952       NaN       NaN
3  0.110903       NaN  0.165769
4 -1.286540       NaN -0.428952
5  0.077007 -0.146501  1.480980
6 -0.886103 -0.040533  0.012097

In [94]:
df.dropna()

          0         1         2
5  0.077007 -0.146501  1.480980
6 -0.886103 -0.040533  0.012097

In [95]:
df.fillna(1) #填充缺失数据

          0         1         2
0  0.004161  1.000000  1.000000
1 -1.048985  1.000000  1.000000
2 -0.617952  1.000000  1.000000
3  0.110903  1.000000  0.165769
4 -1.286540  1.000000 -0.428952
5  0.077007 -0.146501  1.480980
6 -0.886103 -0.040533  0.012097

In [97]:
df.fillna({1:3}) #对不同的列填充不同的值

          0         1         2
0  0.004161  3.000000       NaN
1 -1.048985  3.000000       NaN
2 -0.617952  3.000000       NaN
3  0.110903  3.000000  0.165769
4 -1.286540  3.000000 -0.428952
5  0.077007 -0.146501  1.480980
6 -0.886103 -0.040533  0.012097

In [99]:
dfT=df.T

In [100]:
dfT

          0         1         2         3         4         5         6
0  0.004161 -1.048985 -0.617952  0.110903 -1.286540  0.077007 -0.886103
1       NaN       NaN       NaN       NaN       NaN -0.146501 -0.040533
2       NaN       NaN       NaN  0.165769 -0.428952  1.480980  0.012097

In [101]:
dfT.fillna(method='ffill')  # 添加上一层的数值到NaN

          0         1         2         3         4         5         6
0  0.004161 -1.048985 -0.617952  0.110903 -1.286540  0.077007 -0.886103
1  0.004161 -1.048985 -0.617952  0.110903 -1.286540 -0.146501 -0.040533
2  0.004161 -1.048985 -0.617952  0.165769 -0.428952  1.480980  0.012097

In [105]:
dfT.fillna(method='ffill',limit=1)

          0         1         2         3         4         5         6
0  0.004161 -1.048985 -0.617952  0.110903 -1.286540  0.077007 -0.886103
1  0.004161 -1.048985 -0.617952  0.110903 -1.286540 -0.146501 -0.040533
2       NaN       NaN       NaN  0.165769 -0.428952  1.480980  0.012097

In [106]:
dfT.fillna(dfT.mean()) #填充均值

          0         1         2         3         4         5         6
0  0.004161 -1.048985 -0.617952  0.110903 -1.286540  0.077007 -0.886103
1  0.004161 -1.048985 -0.617952  0.138336 -0.857746 -0.146501 -0.040533
2  0.004161 -1.048985 -0.617952  0.165769 -0.428952  1.480980  0.012097

In [107]:
data = Series(np.random.randn(6),
             index=[list('aaabbb'),['1','2','3','1','2','3']])

In [108]:
data # 层次化索引

a  1    0.984239
   2    0.714385
   3   -0.432215
b  1   -1.413268
   2    0.456848
   3    1.140143
dtype: float64

In [109]:
data['b']

1   -1.413268
2    0.456848
3    1.140143
dtype: float64

In [116]:
data.loc[['a','b']]

a  1    0.984239
   2    0.714385
   3   -0.432215
b  1   -1.413268
   2    0.456848
   3    1.140143
dtype: float64

In [117]:
data.unstack() # Series转化为DataFrame

          1         2         3
a  0.984239  0.714385 -0.432215
b -1.413268  0.456848  1.140143